

CCAMP Working Group                              Dimitri Papadimitriou 
Internet Draft                                               (Alcatel) 
Category: Standard                                                     
                                    
Expiration Date: August 2006                                March 2006 
    
    
    
         Link State Routing Protocols Extensions for ASON Routing 
                                      
             draft-dimitri-ccamp-gmpls-ason-routing-sol-01.txt 
    
    
    
Status of this Memo 
    
   By submitting this Internet-Draft, each author represents that any  
   applicable patent or other IPR claims of which he or she is aware  
   have been or will be disclosed, and any of which he or she becomes  
   aware will be disclosed, in accordance with Section 6 of BCP 79. 
    
   Internet-Drafts are working documents of the Internet Engineering 
   Task Force (IETF), its areas, and its working groups. Note that 
   other groups may also distribute working documents as Internet-
   Drafts. 
    
   Internet-Drafts are draft documents valid for a maximum of six 
   months and may be updated, replaced, or obsoleted by other documents 
   at any time. It is inappropriate to use Internet-Drafts as reference 
   material or to cite them other than as "work in progress." 
    
   The list of current Internet-Drafts can be accessed at 
   http://www.ietf.org/ietf/1id-abstracts.txt. 
    
   The list of Internet-Draft Shadow Directories can be accessed at 
   http://www.ietf.org/shadow.html. 
    
Copyright Notice 
    
   Copyright (C) The Internet Society (2006). All Rights Reserved. 
 
 
Abstract 
    
   The Generalized MPLS (GMPLS) suite of protocols has been defined to 
   control different switching technologies as well as different 
   applications. These include support for requesting TDM connections 
   including SONET/SDH and Optical Transport Networks (OTNs). 
    
   This document provides the extensions of the IETF Link State Routing 
   Protocols to meet the routing requirements for an Automatically 
   Switched Optical Network (ASON) as defined by ITU-T.  
 
 
 
D.Papadimitriou et al. - Expires August 2006                         1 

draft-dimitri-ccamp-gmpls-ason-routing-sol-01.txt        February 2006 
 
 
1. Conventions used in this document 
    
   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", 
   "SHOULD", "SHOULD NOT", "RECOMMENDED",  "MAY", and "OPTIONAL" in this 
   document are to be interpreted as described in RFC 2119 [RFC2119]. 
    
   The reader is assumed to be familiar with the terminology and 
   requirements developed in [ASON-RR] and the evaluation outcomes 
   detailed in [ASON-EVAL]. 
    
2. Introduction 
    
   There are certain capabilities that are needed to support the ITU-T 
   Automatically Switched Optical Network (ASON) control plane 
   architecture as defined in [G.8080]. [ASON-RR] details the routing 
   requirements for the GMPLS suite of routing protocols to support the 
   capabilities and functionality of ASON control planes identified in 
   [G.7715] and in [G.7715.1].  
    
   [ASON-EVAL] evaluates the IETF Link State Routing Protocols against 
   the requirements identified in [ASON-RR]. Candidate routing protocols 
   are IGP (OSPFv2 and IS-IS). 
    
   ASON (Routing) terminology sections are provided in Appendix 1 and 2. 
 
3. Reachability   
    
3.1 OSPFv2 
    
   In order to advertise blocks of reachable address prefixes a 
   summarization mechanism is introduced that complements the 
   techniques described in [OSPF-NODE].  
    
   This extension takes the form of a network mask (a 32-bit number 
   indicating the range of IP addresses residing on a single IP 
   network/subnet). The set of local addresses are carried in an OSPF 
   TE LSA node attribute TLV (a specific sub-TLV is defined per address 
   family, e.g., IPv4 and IPv6). 
 
   The proposed solution is to advertise the local address prefixes of 
   a router as new sub-TLVs of the (OSPFv2 TE LSA) Node Attribute top 
   level TLV (of Type TBD). This document defines the following sub-
   TLVs: 
    
        - Node IPv4 Local Prefix sub-TLV: Type 3 - Length: variable 
        - Node IPv6 Local Prefix sub-TLV: Type 4 - Length: variable 
    
3.1.1 Node IPv4 local prefix sub-TLV 
    
   The node IPv4 local prefix sub-TLV has a type of 3 and contains one 
   or more local IPv4 prefixes. It has the following format: 
    
 
 
D.Papadimitriou et al. - Expires August 2006                         2 

draft-dimitri-ccamp-gmpls-ason-routing-sol-01.txt        February 2006 
 
 
    
     0                   1                   2                   3 
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |              3                |             Length            | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |                         Network Mask 1                        | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |                         IPv4 Address 1                        | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    .                               .                               . 
    .                               .                               . 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |                         Network Mask n                        | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |                         IPv4 Address n                        | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
   The length is set to 8 * n where n is the number of local prefixes 
   included in the sub-TLV. 
    
   Network mask: A 32-bit number indicating the IPv4 address mask 
   for the advertised destination prefix. 
    
   Each <Network mask, IPv4 Address> pair listed as part of this sub-
   TLV represents a reachable destination prefix hosted by the 
   advertising Router ID. 
    
   The local addresses that can be learned from TE LSAs i.e. router 
   address and TE interface addresses SHOULD not be advertised in the 
   node IPv4 local prefix sub-TLV. 
    
3.1.2 Node IPv6 local prefix sub-TLV 
    
   The node IPv6 local prefix sub-TLV has a type of 4 and contains one 
   or more local IPv6 prefixes. IPv6 Prefix Representation uses RFC 
   2740 Section A.4.1. It has the following format: 
 
     0                   1                   2                   3 
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |              4                |             Length            | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    | PrefixLength  | PrefixOptions |             (0)               | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |                                                               | 
    |                     IPv6 Address Prefix 1                     | 
    |                                                               | 
    |                                                               | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    .                               .                               . 
    .                               .                               . 
 
 
D.Papadimitriou et al. - Expires August 2006                         3 

draft-dimitri-ccamp-gmpls-ason-routing-sol-01.txt        February 2006 
 
 
    .                               .                               . 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    | PrefixLength  | PrefixOptions |             (0)               | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |                                                               | 
    |                     IPv6 Address Prefix n                     | 
    |                                                               | 
    |                                                               | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
   PrefixLength: length in bits of the prefix.  
    
   PrefixOptions: 8-bit field describing various capabilities 
   associated with the prefix (see [RFC2740] Section A.4.2).  
    
   Address Prefix: encoding of the prefix itself as an even multiple of 
   32-bit words, padding with zero bits as necessary.  
    
   The Length is set to Sum[n][4 + #32-bit words/4] where n is the 
   number of local prefixes included in the sub-TLV. 
    
   The local addresses that can be learned from TE LSAs i.e. router 
   address and TE interface addresses SHOULD not be advertised in the 
   node IPv6 local prefix sub-TLV.  
    
3.2 IS-IS 
    
   A similar mechanism does not exist for IS-IS as the Extended IP 
   Reachability TLV [RFC3784] focuses on IP reachable end-points 
   (terminating points), as its name indicates.   
    
   For this purpose, a new Extended TE Reachability TLV (Type TBD) is 
   defined as follows 
    
   7 octets of system Id and pseudonode number 
   1 octet of length of sub-TLVs 
   0-246 octets of sub-TLVs,  
      where each sub-TLV consists of a sequence of 
         1 octet of sub-type 
         1 octet of length of the value field of the sub-TLV 
         0-244 octets of value 
    
   Each sub-TLV (Type TBD) is either an IPv4 TE Reachability sub-TLV or 
   an IPv6 TE Reachability sub-TLV. 
    
3.2.1 IPv4 TE Reachability sub-TLV 
    
   The "IPv4 TE Reachability" sub-TLV describes TE reachability through 
   the specification of a routing prefix, a bit to indicate if the 
   prefix is being advertised down from a higher level, and optionally 
   the existence of sub-TLVs to allow for later extension. The 
   following illustrates encoding of the Value field of this sub-TLV 
 
 
D.Papadimitriou et al. - Expires August 2006                         4 

draft-dimitri-ccamp-gmpls-ason-routing-sol-01.txt        February 2006 
 
 
    
       0                   1                   2                   3 
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |U|    Reserved     | Prefix Len|            Prefix             |     
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |            Prefix             | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
   The 6 bits of prefix length can have the values 0-32 and indicate 
   the number of significant bits in the prefix. The prefix is encoded 
   in the minimal number of octets for the given number of significant 
   bits. The remaining bits of prefix are transmitted as zero and 
   ignored upon receipt. 
    
   The U bit is described in Section 6.2. 
    
3.2.2 IPv6 TE Reachability sub-TLV 
    
   The "IPv6 TE Reachability" sub-TLV describes TE reachability through 
   the specification of a routing prefix, a bit to indicate if the 
   prefix is being advertised down from a higher level, and optionally 
   the existence of sub-TLVs to allow for later extension. The 
   following illustrates encoding of the Value field of this sub-TLV 
    
       0                   1                   2                   3 
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |U|   Reserved  |  Prefix Len   |            Prefix             | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |                                                               | 
      ~                             Prefix                            ~ 
      |                                                               | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      | Prefix  ...   | 
      +-+-+-+-+-+-+-+-+ 
    
   The 8 bits of prefix length can have the values 0-128 and indicate 
   the number of significant bits in the prefix. Only the required 
   number of octets of prefix are present. This number can be computed 
   from the prefix length octet as follows: 
    
      prefix octets = integer of ((prefix length + 7) / 8) 
    
   The U bit is described in Section 6.2. 
    
4. Link Attribute 
    
4.1 Local Adaptation   
    
   The Local Adaptation is defined as TE link attribute (i.e. sub-TLV) 
   that describes the cross/inter-layer relationships.  
 
 
D.Papadimitriou et al. - Expires August 2006                         5 

draft-dimitri-ccamp-gmpls-ason-routing-sol-01.txt        February 2006 
 
 
    
   The Interface Switching Capability Descriptor (ISCD) TE Attribute 
   [RFC4202] identifies the ability of the TE link to support cross-
   connection to another link within the same layer and the ability to 
   use a locally terminated connection that belongs to one layer as a 
   data link for another layer (adaptation capability). However, the 
   information associated to the ability to terminate connections 
   within that layer (referred to as the termination capability) is 
   embedded with the adaptation capability.  
    
   For instance, a link between two optical cross-connects will contain 
   at least one ISCD attribute describing LSC switching capability. 
   Whereas a link between an optical cross-connect and an IP/MPLS LSR 
   will contain at least two ISCD attributes: one for the description 
   of the LSC termination capability and one for the PSC adaptation 
   capability. 
    
   Note that per [RFC4202], an interface may have more than one ISCD 
   sub-TLV. Hence, the corresponding advertisements should not result 
   in any compatibility issue.   
       
4.1.2 OSPFv2 
    
   In OSPFv2, the Interface Switching Capability Descriptor is a sub-
   TLV (of type TBA) of the Link TLV (of type 2) [RFC4203].  
    
   The adaptation and termination capabilities are advertised using two 
   separate ISCD sub-TLVs within the same top-level link TLV.  
 
4.1.2 IS-IS 
 
   In IS-IS, the Interface Adaptation Capability Descriptor is a sub-
   TLV (of type TBA) of the Extended IS Reachability TLV (of type 22) 
   [RFC4205].  
    
   The adaptation and termination capabilities are advertised using two 
   separate ISCD sub-TLVs within the same Extended IS Reachability TLV.  
 
4.2 Technology Specific Bandwidth Accounting 
    
   GMPLS Routing defines an Interface Switching Capability Descriptor 
   (ISCD) that delivers among others the information about the 
   (maximum/minimum) bandwidth per priority an LSP can make use of.  
    
   In the ASON context, accounting on per timeslot basis using 32-bit 
   tuples of the form <signal_type (8 bits); number of unallocated 
   timeslots (24 bits)> may optionally be incorporated in the 
   technology specific field of the ISCD TE link attribute when the 
   switching capability field is set to TDM value. When included, 
   format and encoding MUST follow the rules defined in [RFC4202]. 
    

 
 
D.Papadimitriou et al. - Expires August 2006                         6 

draft-dimitri-ccamp-gmpls-ason-routing-sol-01.txt        February 2006 
 
 
   The purpose is purely informative: there is no mandatory processing 
   or topology/traffic-engineering significance associated to this 
   information. 
    
4.2.1 OSPFv2 
    
   In OSPF, the Interface Switching Capability Descriptor is a sub-TLV 
   (of type 15) of the Link TLV (of type 2). 
    
4.2.2 IS-IS 
    
   In IS-IS, the Interface Switching Capability Descriptor is a sub-TLV 
   (of type 21) of the Extended IS Reachability TLV (of type 22). 
     
5. Routing Information Scope 
    
   The Ri is a logical control plane entity that is associated to a 
   control plane "router". The latter is the source for topology 
   information that it generates and shares with other control plane 
   "routers". The Ri is identified by the (advertising) Router_ID. The 
   routing protocol MUST support a single Ri advertising on behalf of 
   more than one Li. Each Li is identified by a unique TE Router ID.  
    
5.1 Link Advertisement (Local and Remote TE Router ID sub-TLV)   
    
   A Router_ID (Ri) advertising on behalf multiple TE Router_ID (Li's) 
   creates a 1:N relationship between the Router_ID and the TE 
   Router_ID. As the link local and link remote (unnumbered) ID 
   association is not unique per node (per Li unicity), the 
   advertisement needs to indicate the remote Lj value and rely on the 
   initial discovery process to retrieve the [Li;Lj] relationship. In 
   brief, as unnumbered links have their ID defined on per Li bases, 
   the remote Lj needs to be identified to scope the link remote ID to 
   the local Li. Therefore, the routing protocol MUST be able to 
   disambiguate the advertised TE links so that they can be associated 
   with the correct TE Router ID. 
    
5.1.1 OSPFv2 
    
   For this purpose, a new sub-TLV of the (OSPFv2 TE LSA) top level 
   Link TLV is introduced that defines the local and the remote 
   TE_Router_ID.  
    
   The type of this sub-TLV is 17, and length is eight octets. The 
   value field of this sub-TLV contains four octets of Local TE Router 
   Identifier followed by four octets of Remote TE Router Identifier. 
   The value of the Remote TE Router Identifier SHOULD NOT be set to 0. 
    
   The format of this sub-TLV is the following: 
 
     0                   1                   2                   3 
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
 
 
D.Papadimitriou et al. - Expires August 2006                         7 

draft-dimitri-ccamp-gmpls-ason-routing-sol-01.txt        February 2006 
 
 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |              17               |             Length            | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  
    |                 Local TE Router Identifier                    | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |                Remote TE Router Identifier                    | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
   This sub-TLV is optional and SHOULD only be included as part of the 
   top level Link TLV if the Router_ID is advertising on behalf of more 
   than one TE_Router_ID. In any other case, this sub-TLV SHOULD be 
   omitted. 
    
   Note: The Link ID sub-TLV that identifies the other end of the link 
   (i.e. Router ID of the neighbor for point-to-point links) MUST 
   appear exactly once per Link TLV. 
    
5.1.2 IS-IS 
    
   For this purpose, a new sub-TLV of the Extended IS Reachability TLV 
   (Type 22, RFC 3784) is introduced that defines the local and the 
   remote TE_Router_ID.  
    
   The type of this sub-TLV is TBD, and length is eight octets. The 
   value field of this sub-TLV contains four octets of Local TE Router 
   Identifier followed by four octets of Remote TE Router Identifier. 
   The value of the Remote TE Router Identifier SHOULD NOT be set to 0. 
    
   The format of the value field of this sub-TLV is the following: 
 
     0                   1                   2                   3 
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  
    |                 Local TE Router Identifier                    | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |                Remote TE Router Identifier                    | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
   This sub-TLV is optional and SHOULD only be included as part of the 
   Extended IS Reachability TLV if the RC is advertising on behalf of 
   more than one TE_Router_ID. In any other case, this sub-TLV SHOULD 
   be omitted. 
 
5.2 Reachability Advertisement (Local TE Router ID sub-TLV)   
    
   When the Router_ID advertises on behalf of multiple TE Router_IDs, 
   the routing protocol MUST be able to associate the advertised 
   reachability information with the correct TE Router ID.  
    
5.2.1 OSPFv2 
    

 
 
D.Papadimitriou et al. - Expires August 2006                         8 

draft-dimitri-ccamp-gmpls-ason-routing-sol-01.txt        February 2006 
 
 
   For this purpose, a new sub-TLV of the (OSPFv2 TE LSA) top level 
   Node Attribute TLV is introduced. This TLV associates the local 
   prefixes (sub-TLV 3 and 4, see above) to a given TE Router_ID.  
    
   The type of this sub-TLV is 5, and length is four octets. The value 
   field of this sub-TLV contains four octets of Local TE Router 
   Identifier [RFC3630].  
    
   The format of this sub-TLV is the following: 
 
     0                   1                   2                   3 
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |              5                |             Length            | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |                 Local TE Router Identifier                    | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
   This sub-TLV is optional and SHOULD only be included as part of the 
   Node Attribute TLV if the Router_ID is advertising on behalf of more 
   than one TE_Router_ID. In any other case, this sub-TLV SHOULD be 
   omitted. 
    
5.2.2 IS-IS 
    
   For this purpose, a new sub-TLV of the newly defined Extended TE 
   Reachability TLV is introduced that defines the local TE_Router_ID.  
    
   The type of this sub-TLV is TBD, and length is four octets. The 
   value field of this sub-TLV contains four octets of Local TE Router 
   Identifier [RFC3784].  
    
   The format of the value field of this sub-TLV is the following: 
 
     0                   1                   2                   3 
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  
    |                 Local TE Router Identifier                    | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
   This sub-TLV is optional and SHOULD only be included as part of the 
   Extended TE Reachability TLV if the RC is advertising on behalf of 
   more than one TE_Router_ID. In any other case, this sub-TLV SHOULD 
   be omitted. 
    
6. Routing Information Dissemination 
    
6.1 OSPFv2 
    
   RC disseminates downward/upward the hierarchy by re-originating this 
   routing information as Opaque TE LSA (Opaque Type 1) of LS Type 10.  
    
 
 
D.Papadimitriou et al. - Expires August 2006                         9 

draft-dimitri-ccamp-gmpls-ason-routing-sol-01.txt        February 2006 
 
 
   The information that MAY be exchanged between adjacent levels 
   includes the Router_Address, Link and Node_Attribute top level TLV. 
 
   The Opaque TE LSA re-origination is governed as follows: 
   - If the target interface is associated to the same area than the  
     one associated with the receiving interface, the Opaque LSA MUST  
     NOT be re-originated out that interface. 
   - If a match is found between the Advertising Router ID in the  
     received Opaque TE LSA and one of the Router ID belonging to the  
     area of the target interface, the Opaque LSA MUST NOT be re- 
     originated out that interface.  
   - If these two conditions are met the Opaque TE LSA MAY be re- 
     originated. 
    
   The re-originated content MAY be transformed e.g. filtered, as long 
   as the resulting routing information is consistent. In particular, 
   when than one RC are bound to adjacent levels and both allowed to 
   redistribute routing information it is expected that these 
   transformation are performed in consistent manner. Definition of 
   these policy mechanisms is outside the scope of this document. 
    
   In practice, and in order to avoid scalability and processing 
   overhead, routing information re-distributed downward/upward the 
   hierarchy is expected to include reachability information (see 
   Section 3.1) and upon strict policy control link topology 
   information.  
    
6.1.1 Discovery and Selection 
 
   In order to discover RCs that are capable to disseminate routing 
   information upward the routing hierarchy, the following Capability 
   Descriptor bit [OSPF-TE-CAP] are defined: 
 
   - U bit: when set, this flag indicates that the RC is capable to  
     disseminate routing information upward the adjacent level. 
    
   In case of multiple supporting RCs, the RC with the highest Router 
   ID SHOULD be selected. More precisely, the RC with the highest 
   Router ID among the RCs having set the U bit SHOULD be selected as 
   the RC for upward dissemination of routing information. It is 
   expected that other RCs will not participate in the upward 
   dissemination of routing information as long as the opaque LSA 
   information corresponding to the highest Router ID RC does not reach 
   MaxAge.  
    
   Note that alternatively if this information cannot be discovered 
   automatically, it MUST be manually configured.  
    
   The same mechanism is used for selecting the RC taking in charge 
   dissemination of routing information downward the hierarchy with the 
   restriction that the RC selection process needs to take into account 
   that an upper level may be adjacent to one or more lower levels. For 
 
 
D.Papadimitriou et al. - Expires August 2006                        10 

draft-dimitri-ccamp-gmpls-ason-routing-sol-01.txt        February 2006 
 
 
   this purpose a specific TLV indexing the (lower) area ID to which 
   the RC's are capable to disseminate routing information is needed. 
    
   OSPF Associated Area ID TLV format carried in the OSPF router 
   information LSA [OSPF-CAP] is defined. This TLV has the following 
   format:    
                  
    0                   1                   2                   3   
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1   
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+   
   |              Type             |             Length            |   
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+   
   |                       Associated Area ID                      | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+   
                  
   Type (16 bits): identifies the TLV type   
   Length (16 bits): length of the value field in octets   
   Value (32 bits): Associated Area ID whose value space is the Area ID 
   as defined in [RFC2328]. 
    
   Note that this information MUST be present when the D bit is set. To 
   discover RCs that are capable to disseminate routing information 
   downward the routing hierarchy, the following Capability Descriptor 
   bit [OSPF-TE-CAP] is defined, that MUST be advertised together with 
   the OSPF Area ID TLV: 
 
   - D bit: when set, this flag indicates that the RC is capable to  
     disseminate routing information downward the adjacent level. 
    
   In case of multiple supporting RCs for the same Associated Area ID, 
   the RC with the highest Router ID SHOULD be selected. More 
   precisely, the RC with the highest Router ID among the RCs having 
   set the D bit SHOULD be selected as the RC for downward 
   dissemination of routing information. It is expected that other RCs 
   for the same Associated Area ID will not participate in the downward 
   dissemination of routing information as long as the opaque LSA 
   information corresponding to the highest Router ID RC does not reach 
   MaxAge. 
    
   Note that alternatively if this information cannot be discovered 
   automatically, it MUST be manually configured. 
 
   The OSPF Router information opaque LSA (opaque type of 4, opaque ID 
   of 0) and its content in particular, the Router Informational 
   Capabilities TLV [OSPF-CAP] and TE Node Capability Descriptor TLV 
   [OSPF-TE-CAP] MUST NOT be re-originated.   
    
6.1.2 Loop prevention 
    
   When more than one RC are bound to adjacent levels of the hierarchy, 
   configured and selected to redistribute upward and downward the 
   routing information, a specific mechanism is required to avoid 
 
 
D.Papadimitriou et al. - Expires August 2006                        11 

draft-dimitri-ccamp-gmpls-ason-routing-sol-01.txt        February 2006 
 
 
   looping/re-introduction of routing information back to the upper 
   level. In all other cases, the procedure described in this section 
   is optional.  
    
   When these conditions are met, it is necessary to have a mean by 
   which an RC receiving an Opaque TE LSA re-originated downward by an 
   RC associated to the same area omits to re-originate back the 
   content of this LSA upward into the (same) upper level. 
    
   Thus we need some way of filtering the downward/onward re-originated 
   Opaque TE LSA.  
    
   For opaque LSAs including the Router Address TLV, if the Router 
   address has been already installed into the TEDB, the LSA should not 
   be re-originated since this address belongs to a router part of the 
   target area.  
    
   For opaque LSAs including the Link TLV, if the Link ID has been 
   already installed into the TEDB, the LSA should not be re-originated 
   since the corresponding router ID belongs to a router part of the 
   target area. 
    
   For opaque LSAs including the Node Attribute TLV, if one of the 
   included prefixes has been already installed into the TEDB, the LSA 
   should not be re-originated with that prefix since the corresponding 
   reachable end-points belonging to a router part of the target area. 
   If no prefix remains, the LSA SHOULD not be re-originated. 
    
6.2. IS-IS 
    
6.2.1 Discovery and Selection 
 
   In order to discover RCs that are capable to disseminate routing 
   information upward the routing hierarchy, the following Capability 
   Descriptor bit [ISIS-TE-CAP] are defined: 
 
   - U bit: when set, this flag indicates that the RC is capable to  
     disseminate routing information upward the adjacent level. 
    
   In case of multiple supporting RCs, the RC with the highest Router 
   ID [ISIS-CAP] SHOULD be selected. More precisely, the RC with the 
   highest Router ID among the RCs having set the U bit SHOULD be 
   selected as the RC for upward dissemination of routing information. 
   It is expected that other RCs will not participate in the upward 
   dissemination of routing information as long as the routing 
   information corresponding to the highest Router ID RC is not 
   withdrawn. 
    
   Note that alternatively if this information cannot be discovered 
   automatically, it MUST be manually configured.  
    

 
 
D.Papadimitriou et al. - Expires August 2006                        12 

draft-dimitri-ccamp-gmpls-ason-routing-sol-01.txt        February 2006 
 
 
   The same mechanism is used for selecting the RC taking in charge 
   dissemination of routing information downward the hierarchy with the 
   restriction that the RC selection process needs to take into account 
   that an upper level may be adjacent to one or more lower levels. For 
   this purpose a specific TLV indexing the (lower) ISIS area ID to 
   which the RC's are capable to disseminate routing information is 
   needed. 
    
   To discover RCs that are capable to disseminate routing information 
   downward the routing hierarchy, the following Capability Descriptor 
   bit [ISIS-TE-CAP] is defined: 
 
   - D bit: when set, this flag indicates that the RC is capable to  
     disseminate routing information downward the adjacent level. 
    
   In case of multiple supporting RCs for the same ISIS Area ID, the RC 
   with the highest Router ID SHOULD be selected. More precisely, the 
   RC with the highest Router ID among the RCs having set the D bit 
   SHOULD be selected as the RC for downward dissemination of routing 
   information. It is expected that other RCs for the same Area ID will 
   not participate in the downward dissemination of routing information 
   as long as the routing information corresponding to the highest 
   Router ID RC is not withdrawn. 
    
   Note that alternatively if this information cannot be discovered 
   automatically, it MUST be manually configured. 
 
   The ISIS Router Capability TLV [ISIS-CAP] and its content in 
   particular MUST NOT be redistributed between adjacent levels.   
    
6.2.2 Loop prevention 
    
   As described in [RFC3784], to prevent this looping of TE reachable 
   prefixes between levels, an up/down bit (U bit) is defined in the 
   newly defined extended TE reachability TLV.  
    
   The up/down bit MUST be set to 0 when a prefix is first injected 
   into IS-IS.  If a prefix is advertised from a higher level to a 
   lower level (e.g. level 2 to level 1), the bit MUST be set to 1, 
   indicating that the prefix has traveled down the hierarchy. Prefixes 
   that have the up/down bit set to 1 may only be advertised down the 
   hierarchy, i.e. to lower levels.  
    
   For the extended IS reachability TLV, the same re-origination rules 
   as described in Section 6.1.2 applies.  
    
7. OSPFv2 Extensions  
 
7.1 Compatibility  
    
   Extensions specified in this document are associated to the  
    
 
 
D.Papadimitriou et al. - Expires August 2006                        13 

draft-dimitri-ccamp-gmpls-ason-routing-sol-01.txt        February 2006 
 
 
   OSPFv2 TE LSA: 
    
   o) Router Address top level TLV (Type 1): 
      - no additional sub-TLV 
    
   o) Link top level TLV (Type 2):  
      - Local and Remote TE Router ID sub-TLV: optional sub-TLV for  
        scoping link attributes per TE_Router ID 
    
   o) Node Attribute top level TLV (Type TBD): 
      - Node IPv4 Local Prefix sub-TLVs: optional sub-TLV for IPv4  
        reachability advertisement 
      - Node IPv6 Local Prefix sub-TLVs: optional sub-TLV for IPv6    
        reachability advertisement 
      - Local TE Router ID sub-TLV: optional sub-TLV for scoping     
        reachability per TE_Router ID 
    
   OSPFv2 RI LSA: 
    
   o) Routing information dissemination 
      - U and D bit in Capability Descriptor TLV [OSPF-TE-CAP] 
      - Associated Area ID TLV in the OSPF Routing Information LSA  
        [OSPF-CAP] 
       
7.2 Scalability 
    
   o) Routing information exchange upward/downward the hierarchy 
   between adjacent areas SHOULD by default be limited to reachability. 
   In addition, several transformation such as prefix aggregation are 
   recommended when allowing decreasing the amount of information re-
   originated by a given RC without impacting consistency. 
  
   o) Routing information exchange upward/downward the hierarchy when 
   involving TE attributes MUST be under strict policy control. Pacing 
   and min/max thresholds for triggered updates are strongly 
   recommended. 
 
8. IS-IS Extensions and Compatibility  
    
   TBD 
 
9. Acknowledgements 
    
   The authors would like to thank Alan Davey and Adrian Farrel for 
   their useful comments and suggestions. 
 
10. References 
    
11.1 Normative References 
    
    
 
 
 
D.Papadimitriou et al. - Expires August 2006                        14 

draft-dimitri-ccamp-gmpls-ason-routing-sol-01.txt        February 2006 
 
 
   [OSPF-NODE]  R.Aggarwal, and K.Kompella, "Advertising a Router's 
                Local Addresses in OSPF TE Extensions," Internet Draft, 
                (work in progress), draft-ietf-ospf-te-node-addr-
                02.txt, March 2005. 
    
   [RFC2026]    S.Bradner, "The Internet Standards Process --          
                Revision 3", BCP 9, RFC 2026, October 1996.            
    
   [RFC2328]    J.Moy, "OSPF Version 2", RFC 2328, April 1998. 
    
   [RFC2740]    R.Coltun et al. "OSPF for IPv6", RFC 2740, December 
                1999. 
    
   [RFC2119]    S.Bradner, "Key words for use in RFCs to Indicate      
                Requirement Levels", BCP 14, RFC 2119, March 1997.  
    
   [RFC3477]    K.Kompella et al. "Signalling Unnumbered Links in 
                Resource ReSerVation Protocol - Traffic Engineering 
                (RSVP-TE)", RFC 3477, January 2003. 
    
   [RFC3630]    D.Katz et al. "Traffic Engineering (TE) Extensions to 
                OSPF Version 2", RFC 3630, September 2003. 
    
   [RFC3667]    S.Bradner, "IETF Rights in Contributions", BCP 78, 
                RFC 3667, February 2004. 
                 
   [RFC3668]    S.Bradner, Ed., "Intellectual Property Rights in IETF 
                Technology", BCP 79, RFC 3668, February 2004.  
                 
   [RFC3784]    H.Smit and T.Li, "Intermediate System to Intermediate 
                System (IS-IS) Extensions for Traffic Engineering (TE)," 
                RFC 3784, June 2004. 
                         
   [RFC3946]    E.Mannie, and D.Papadimitriou, (Editors) et al.,  
                "Generalized Multi-Protocol Label Switching Extensions  
                for SONET and SDH Control," RFC 3946, October 2004.  
      
   [RFC4202]    Kompella, K. (Editor) et al., "Routing Extensions in  
                Support of Generalized MPLS," RFC 4202, October 2005. 
    
8.2 Informative References 
    
   [ASON-EVAL]  C.Hopps et al. "Evaluation of existing Routing Protocols 
                against ASON Routing Requirements", Work in progress, 
                draft-ietf-ccamp-gmpls-ason-routing-eval-02.txt, October 
                2005. 
    
   [ASON-RR]    D.Brungard et al. "Requirements for Generalized MPLS 
                (GMPLS) Routing for Automatically Switched Optical 
                Network (ASON)," RFC 4258, November 2005. 
    
   For information on the availability of ITU Documents, please see  
 
 
D.Papadimitriou et al. - Expires August 2006                        15 

draft-dimitri-ccamp-gmpls-ason-routing-sol-01.txt        February 2006 
 
 
   http://www.itu.int 
 
   [G.7715]     ITU-T Rec. G.7715/Y.1306, "Architecture and    
                Requirements for the Automatically Switched Optical  
                Network (ASON)," June 2002. 
    
   [G.7715.1]   ITU-T Draft Rec. G.7715.1/Y.1706.1, "ASON Routing 
                Architecture and Requirements for Link State Protocols," 
                November 2003. 
    
   [G.8080]     ITU-T Rec. G.8080/Y.1304, "Architecture for the        
                Automatically Switched Optical Network (ASON),"        
                November 2001 (and Revision, January 2003). 
                 
9. Author's Addresses   
    
   Dimitri Papadimitriou (Alcatel) 
   Francis Wellensplein 1,  
   B-2018 Antwerpen, Belgium 
   Phone: +32 3 2408491 
   EMail: dimitri.papadimitriou@alcatel.be 































 
 
D.Papadimitriou et al. - Expires August 2006                        16 

draft-dimitri-ccamp-gmpls-ason-routing-sol-01.txt        February 2006 
 
 
Appendix 1: ASON Terminology 
    
   This document makes use of the following terms: 
    
   Administrative domain: (see Recommendation G.805) for the purposes of 
   [G7715.1] an administrative domain represents the extent of resources 
   which belong to a single player such as a network operator, a service 
   provider, or an end-user. Administrative domains of different players 
   do not overlap amongst themselves. 
    
   Control plane: performs the call control and connection control 
   functions. Through signaling, the control plane sets up and releases 
   connections, and may restore a connection in case of a failure. 
    
   (Control) Domain: represents a collection of (control) entities that 
   are grouped for a particular purpose. The control plane is subdivided 
   into domains matching administrative domains. Within an 
   administrative domain, further subdivisions of the control plane are 
   recursively applied. A routing control domain is an abstract entity 
   that hides the details of the RC distribution. 
    
   External NNI (E-NNI): interfaces are located between protocol 
   controllers between control domains. 
    
   Internal NNI (I-NNI): interfaces are located between protocol 
   controllers within control domains. 
    
   Link: (see Recommendation G.805) a "topological component" which 
   describes a fixed relationship between a "subnetwork" or "access 
   group" and another "subnetwork" or "access group". Links are not 
   limited to being provided by a single server trail.  
    
   Management plane: performs management functions for the Transport 
   Plane, the control plane and the system as a whole. It also provides 
   coordination between all the planes. The following management 
   functional areas are performed in the management plane: performance, 
   fault, configuration, accounting and security management 
    
   Management domain: (see Recommendation G.805) a management domain 
   defines a collection of managed objects which are grouped to meet 
   organizational requirements according to geography, technology, 
   policy or other structure, and for a number of functional areas such 
   as configuration, security, (FCAPS), for the purpose of providing 
   control in a consistent manner. Management domains can be disjoint, 
   contained or overlapping. As such the resources within an 
   administrative domain can be distributed into several possible 
   overlapping management domains. The same resource can therefore 
   belong to several management domains simultaneously, but a management 
   domain shall not cross the border of an administrative domain. 
    
   Subnetwork Point (SNP): The SNP is a control plane abstraction that 
   represents an actual or potential transport plane resource. SNPs (in 
 
 
D.Papadimitriou et al. - Expires August 2006                        17 

draft-dimitri-ccamp-gmpls-ason-routing-sol-01.txt        February 2006 
 
 
   different subnetwork partitions) may represent the same transport 
   resource. A one-to-one correspondence should not be assumed. 
    
   Subnetwork Point Pool (SNPP): A set of SNPs that are grouped together 
   for the purposes of routing. 
    
   Termination Connection Point (TCP): A TCP represents the output of a 
   Trail Termination function or the input to a Trail Termination Sink 
   function. 
 
   Transport plane: provides bi-directional or unidirectional transfer 
   of user information, from one location to another. It can also 
   provide transfer of some control and network management information. 
   The Transport Plane is layered; it is equivalent to the Transport 
   Network defined in G.805 Recommendation. 
    
   User Network Interface (UNI): interfaces are located between protocol 
   controllers between a user and a control domain. Note: there is no 
   routing function associated with a UNI reference point.  
    
    































 
 
D.Papadimitriou et al. - Expires August 2006                        18 

draft-dimitri-ccamp-gmpls-ason-routing-sol-01.txt        February 2006 
 
 
Appendix 2: ASON Routing Terminology 
    
   This document makes use of the following terms: 
    
   Routing Area (RA): a RA represents a partition of the data plane and 
   its identifier is used within the control plane as the representation 
   of this partition. Per [G.8080] a RA is defined by a set of sub-
   networks, the links that interconnect them, and the interfaces 
   representing the ends of the links exiting that RA. A RA may contain 
   smaller RAs inter-connected by links. The limit of subdivision 
   results in a RA that contains two sub-networks interconnected by a 
   single link. 
    
   Routing Database (RDB): repository for the local topology, network 
   topology, reachability, and other routing information that is updated 
   as part of the routing information exchange and may additionally 
   contain information that is configured. The RDB may contain routing 
   information for more than one Routing Area (RA). 
    
   Routing Components: ASON routing architecture functions. These 
   functions can be classified as protocol independent (Link Resource 
   Manager or LRM, Routing Controller or RC) and protocol specific 
   (Protocol Controller or PC).  
    
   Routing Controller (RC): handles (abstract) information needed for 
   routing and the routing information exchange with peering RCs by 
   operating on the RDB. The RC has access to a view of the RDB. The RC 
   is protocol independent. 
    
   Note: Since the RDB may contain routing information pertaining to 
   multiple RAs (and possibly to multiple layer networks), the RCs 
   accessing the RDB may share the routing information. 
    
   Link Resource Manager (LRM): supplies all the relevant component and 
   TE link information to the RC. It informs the RC about any state 
   changes of the link resources it controls. 
    
   Protocol Controller (PC): handles protocol specific message exchanges 
   according to the reference point over which the information is 
   exchanged (e.g. E-NNI, I-NNI), and internal exchanges with the RC. 
   The PC function is protocol dependent. 
    










 
 
D.Papadimitriou et al. - Expires August 2006                        19 

draft-dimitri-ccamp-gmpls-ason-routing-sol-01.txt        February 2006 
 
 
Full Copyright Statement 
    
   Copyright (C) The Internet Society (2005). This document is subject 
   to the rights, licenses and restrictions contained in BCP 78, and 
   except as set forth therein, the authors retain all their rights. 
    
   This document and the information contained herein are provided on 
   an "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE 
   REPRESENTSOR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE 
   INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR 
   IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF 
   THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED 
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. 
 
Intellectual Property 
    
   The IETF takes no position regarding the validity or scope of any 
   Intellectual Property Rights or other rights that might be claimed 
   to pertain to the implementation or use of the technology described 
   in this document or the extent to which any license under such 
   rights might or might not be available; nor does it represent that 
   it has made any independent effort to identify any such rights.  
   Information on the procedures with respect to rights in RFC 
   documents can be found in BCP 78 and BCP 79. 
    
   Copies of IPR disclosures made to the IETF Secretariat and any 
   assurances of licenses to be made available, or the result of an 
   attempt made to obtain a general license or permission for the use 
   of such proprietary rights by implementers or users of this 
   specification can be obtained from the IETF on-line IPR repository 
   at http://www.ietf.org/ipr. 
    
   The IETF invites any interested party to bring to its attention any 
   copyrights, patents or patent applications, or other proprietary 
   rights that may cover technology that may be required to implement 
   this standard. Please address the information to the IETF at ietf- 
   ipr@ietf.org.  
    
    













 
 
D.Papadimitriou et al. - Expires August 2006                        20 
